gneidermeier/stm8_mcp/src/driver.c
/*
 * decrement set and return present motor speed value
 */
uint16_t BLDC_PWMDC_Minus()
{
    if (BLDC_ON == BLDC_State)
    {
// if (DC > PWM_20PCNT)
        dec_dutycycle();
    }
    return global_uDC;
}

/*
 * TEST DEV ONLY: manual adjustment of commutation cycle time)
 */
void BLDC_Spd_dec()
{
    if (BLDC_OFF == BLDC_State)
    {
        BLDC_State = BLDC_RAMPUP;
        uart_print( "OFF->RAMP-\r\n");
    }

    if (BLDC_ON == BLDC_State  && BLDC_OL_comm_tm < 0xFFFF)
    {
        Manual_Mode = 1;
        BLDC_OL_comm_tm += 1; // slower
    }

    Log_Level = 255;// enable continous/verbous log
}

/*
 * TEST DEV ONLY: manual adjustment of commutation cycle time)
 */
void BLDC_Spd_inc()
{
    Log_Level = 1; // default on INC button is just print one line

    if (BLDC_OFF == BLDC_State)
    {
        BLDC_State = BLDC_RAMPUP;
        // BLDC_OL_comm_tm ... init in OFF state to _OL_TM_LO_SPD, don't touch!

        uart_print( "OFF->RAMP+\r\n");
        Log_Level = 0xFF; // log enuff output to span the startup (logger is slow, doesn't take that many)
    }

    if (BLDC_ON == BLDC_State  && BLDC_OL_comm_tm > BLDC_OL_TM_MANUAL_HI_LIM )
    {
        Manual_Mode = 1;
        BLDC_OL_comm_tm -= 1; // faster
    }
}


/*
 * BLDC Update: 
 *  Called from ISR
 *  Handle the BLDC state: 
 *      Off: nothing
 *      Rampup: get BLDC up to sync speed to est. comm. sync.
 *              Once the HI OL speed (frequency) is reached, then the idle speed
 *              must be established, i.e. controlling PWM DC to ? to achieve 2500RPM
 *              To do this closed loop, will need to internally time between the
 *              A/D or comparator input interrupts and adjust DC using e.g. Proportional
 *              control. When idle speed is reached, can transition to user control i.e. ON State
 *      On:  definition of ON state - user control (button inputs) has been enabled
 *              1) ideally, does nothing - BLDC_Step triggered by A/D comparator event
 *              2) less ideal, has to check A/D or comp. result and do the comm.
 *                 step ... but the resolution will be these discrete steps
 *                 (of TIM1 reference)
 */
static uint16_t   Table_value; //whats up w/ stupid compiler optimizing
static int vsys_fault_bucket;

void BLDC_Update(void)
{
    const int FAULT_BUCKET_INI = 128;

// if the voltage threshold is high enuff, the ramp delay time thingy not needed
    const int RAMP_TIME = 1;   // fault arming delay time
    static uint16_t fault_arming_time; // fault_arming_time  

    switch (BLDC_State)
    {
    default:
    case BLDC_OFF:
        // reset commutation timer and ramp-up counters ready for ramp-up
        BLDC_OL_comm_tm = BLDC_OL_TM_LO_SPD;

        vsys_fault_bucket = FAULT_BUCKET_INI;

        // delay to wait to stabillize at first DC setpoint post-ramp
        fault_arming_time = RAMP_TIME;    /////// // reset the static ramp timer

        break;

    case BLDC_ON:
        // do ON stuff
        Vsystem = Vbatt / 2 + Vsystem / 2; // sma
#if 0
        if ( fault_arming_time  > 0 )
        {
            fault_arming_time   -= 1;
        }
        else    // assert (Vbatt > VVV )
#endif
        {
            // check system voltage ... is motor stalled?
            if (Vsystem < V_SHUTDOWN_THR)
            {
                // voltage has sagged ... likely motor stall!
                if ( vsys_fault_bucket  > 0)
                {
                    vsys_fault_bucket -= 1; //
                }
            }
            else
            {
                if ( vsys_fault_bucket  < FAULT_BUCKET_INI )
                {
                    vsys_fault_bucket += 1; // refillin leaky bucket
                }
            }
// finally, check if fault is set
            if (0 == vsys_fault_bucket)
            {
                // 0 DC safely stops the motor, user must still press STOP to cycle the program.
                set_dutycycle( PWM_0PCNT );
            }
        }

// grab the "speed" number from the table, determine (sign of) error and incr. +/- 1
        if ( 0 == Manual_Mode   && global_uDC < 0x50) // tmp : limit of the taBle
        {
            int error, step = 0;
            Table_value =  OL_Timing[ global_uDC ];
// ol_timing =  OL_Timing[ global_uDC ]; // ??
            error =  Table_value  - BLDC_OL_comm_tm;
            /*
             * the C-T increments between PWM steps are rather large as speeding up 
             * so it may be possible to comp. by reducing rate of this loop by /2
             */
            if (error > 0)
            {
                step = 1;
            }
            else if (error < 0)
            {
                step = -1;
            }

            if (Table_value != 0) // assert
            {
                BLDC_OL_comm_tm += step; // incrementally adjust until error reduces to 0.
            }
        }

        break;

    case BLDC_RAMPUP:

        set_dutycycle( PWM_DC_RAMPUP ) ;

        if (BLDC_OL_comm_tm > BLDC_OL_TM_HI_SPD) // state-transition trigger?
        {
            BLDC_OL_comm_tm -= BLDC_ONE_RAMP_UNIT;
        }
        else
        {
            BLDC_State = BLDC_ON;

            Vsystem = Vbatt; // "pre-load" the avergae to avoid kicking out at end of ramp1

            Manual_Mode = 0;
            set_dutycycle( PWM_DC_IDLE );

            Log_Level = 16; // tmp debug
        }
        break;
    }

//  update the timer for the OL commutation switch time
    TIM3_setup(BLDC_OL_comm_tm);
}


/*
 * called from ISR
 *
// establish error-signal ...
// measures at 4 15-degree intervals - [1] and [2] are the valid ones to "integrate"
// Note at this low idle/open-loop speed there are only about 4 PWM @ 8k during
// a 60-degree sector.
// Pulses close to start/end of the secctor are problematic anyway as the ADC 
// ISR ends up getting blocked by the TIM3 ISR ... the BLDC_Step() takes about
// to 40us on case 3!
 */
void BLDC_Step(void)
{
    const uint8_t N_CSTEPS = 6;

    static uint8_t bldc_step_modul; // internal counter for sub-dividing the TIM3 period

    static COMMUTATION_SECTOR_t bldc_step = 0;

    // grab the state of previous sector (before advancing the 6-step sequence)
    BLDC_PWM_STATE_t     prev_A = Commutation_Steps[ bldc_step ].phA;

    int16_t back_EMF_int;


    if (BLDC_OFF != BLDC_State )
    {
        int index = bldc_step_modul % TIM3_RATE_MODULUS;

// Note if wanting all 3 phases would need to coordinate here to set the
// correct ADC channel to sample.

        switch(index)
        {
        case 0:
            Back_EMF_15304560[0] = GET_BACK_EMF_ADC( );
            break;
        case 1:
            Back_EMF_15304560[1] = GET_BACK_EMF_ADC( );
            break;
        case 2:
            Back_EMF_15304560[2] = GET_BACK_EMF_ADC( );
            break;
        case 3:
            Back_EMF_15304560[3] = GET_BACK_EMF_ADC( );

// should add the integral steps in each step case ;)
            back_EMF_int = Back_EMF_15304560[1] + Back_EMF_15304560[2];

            if ( DC_OUTP_FLOAT_R == prev_A )
            {
            }
            else  if (DC_OUTP_FLOAT_F == prev_A )
            {
// refresh the global that is dsplayed on terminal
// memcpy (Back_EMF_15304560, Back_EMF_Falling_4, sizeof(uint16), 4);
                Back_EMF_Falling_4[0] = Back_EMF_15304560[0];
                Back_EMF_Falling_4[1] = Back_EMF_15304560[1];
                Back_EMF_Falling_4[2] = Back_EMF_15304560[2];
                Back_EMF_Falling_4[3] = Back_EMF_15304560[3];

                Back_EMF_Falling_Int_PhX = back_EMF_int; // theoretically, nearing 0 when motor is in time!
            }
            else  if (DC_OUTP_HI == prev_A)
            {
                // if phase was driven pwm, then this shouuld be a valid vbat sample
                Vbatt = GET_ADC();
            }

            bldc_step += 1;
            bldc_step %= N_CSTEPS;

            comm_switch( bldc_step );

            break;
        }

        bldc_step_modul += 1; // can be allowed to rollover as modulus is pwrOf2
    }
    else
    {
        // motor drive output is not active
        GPIOC->ODR &=  ~(1<<5); //  /SD A
        GPIOC->ODR &=  ~(1<<7); //  /SD B
        GPIOG->ODR &=  ~(1<<1); //  /SD C

        TIM1_CtrlPWMOutputs(DISABLE);
    }
}
